----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 64, 128, 128]           1,792
              ReLU-2         [-1, 64, 128, 128]               0
            Conv2d-3         [-1, 64, 128, 128]          36,928
              ReLU-4         [-1, 64, 128, 128]               0
         MaxPool2d-5           [-1, 64, 64, 64]               0
            Conv2d-6          [-1, 128, 64, 64]          73,856
              ReLU-7          [-1, 128, 64, 64]               0
            Conv2d-8          [-1, 128, 64, 64]         147,584
              ReLU-9          [-1, 128, 64, 64]               0
        MaxPool2d-10          [-1, 128, 32, 32]               0
           Conv2d-11          [-1, 256, 32, 32]         295,168
             ReLU-12          [-1, 256, 32, 32]               0
         Upsample-13          [-1, 256, 64, 64]               0
           Conv2d-14          [-1, 128, 64, 64]         295,040
             ReLU-15          [-1, 128, 64, 64]               0	
           Conv2d-16          [-1, 128, 64, 64]         147,584
             ReLU-17          [-1, 128, 64, 64]               0
		 add	      [-1, 128, 64, 64]		      0
         Upsample-18        [-1, 128, 128, 128]               0
           Conv2d-19         [-1, 64, 128, 128]          73,792
             ReLU-20         [-1, 64, 128, 128]               0
           Conv2d-21         [-1, 64, 128, 128]          36,928
             ReLU-22         [-1, 64, 128, 128]               0
		 add	     [-1, 64, 128, 128]	      	      0
           Conv2d-23          [-1, 3, 128, 128]           1,731
             ReLU-24          [-1, 3, 128, 128]               0
================================================================
Total params: 1,110,403
Trainable params: 1,110,403
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.19
Forward/backward pass size (MB): 127.75
Params size (MB): 4.24
Estimated Total Size (MB): 132.17
----------------------------------------------------------------