----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 32, 128, 128]             896
         LeakyReLU-2         [-1, 32, 128, 128]               0
            Conv2d-3         [-1, 32, 128, 128]           9,248
         LeakyReLU-4         [-1, 32, 128, 128]               0
         MaxPool2d-5           [-1, 32, 64, 64]               0
            Conv2d-6           [-1, 32, 64, 64]           9,248
         LeakyReLU-7           [-1, 32, 64, 64]               0
            Conv2d-8           [-1, 32, 64, 64]           9,248
         LeakyReLU-9           [-1, 32, 64, 64]               0
        MaxPool2d-10           [-1, 32, 32, 32]               0
           Conv2d-11           [-1, 64, 32, 32]          18,496
        LeakyReLU-12           [-1, 64, 32, 32]               0
           Conv2d-13           [-1, 64, 32, 32]          36,928
        LeakyReLU-14           [-1, 64, 32, 32]               0
        MaxPool2d-15           [-1, 64, 16, 16]               0
           Conv2d-16           [-1, 64, 16, 16]          36,928
        LeakyReLU-17           [-1, 64, 16, 16]               0
           Conv2d-18           [-1, 64, 16, 16]          36,928
        LeakyReLU-19           [-1, 64, 16, 16]               0
        MaxPool2d-20             [-1, 64, 8, 8]               0
           Conv2d-21             [-1, 64, 8, 8]          36,928
        LeakyReLU-22             [-1, 64, 8, 8]               0
           Conv2d-23             [-1, 64, 8, 8]          36,928
        LeakyReLU-24             [-1, 64, 8, 8]               0
        MaxPool2d-25             [-1, 64, 4, 4]               0
           Conv2d-26            [-1, 128, 4, 4]          73,856
        LeakyReLU-27            [-1, 128, 4, 4]               0
  ConvTranspose2d-28            [-1, 128, 8, 8]         262,272
           Conv2d-29             [-1, 64, 8, 8]          73,792
        LeakyReLU-30             [-1, 64, 8, 8]               0
           Conv2d-31             [-1, 64, 8, 8]          36,928
        LeakyReLU-32             [-1, 64, 8, 8]               0
		 add		 [-1, 64, 8, 8]		      0
  ConvTranspose2d-33           [-1, 64, 16, 16]          65,600
           Conv2d-34           [-1, 64, 16, 16]          36,928
        LeakyReLU-35           [-1, 64, 16, 16]               0
           Conv2d-36           [-1, 64, 16, 16]          36,928
        LeakyReLU-37           [-1, 64, 16, 16]               0
		 add	       [-1, 64, 16, 16]		      0
  ConvTranspose2d-38           [-1, 64, 32, 32]          65,600
           Conv2d-39           [-1, 64, 32, 32]          36,928
        LeakyReLU-40           [-1, 64, 32, 32]               0
           Conv2d-41           [-1, 64, 32, 32]          36,928
        LeakyReLU-42           [-1, 64, 32, 32]               0
		 add	       [-1, 64, 32, 32]		      0
  ConvTranspose2d-43           [-1, 64, 64, 64]          65,600
           Conv2d-44           [-1, 32, 64, 64]          18,464
        LeakyReLU-45           [-1, 32, 64, 64]               0
           Conv2d-46           [-1, 32, 64, 64]           9,248
        LeakyReLU-47           [-1, 32, 64, 64]               0
		 add	       [-1, 32, 64, 64]		      0	
  ConvTranspose2d-48         [-1, 32, 128, 128]          16,416
           Conv2d-49         [-1, 32, 128, 128]           9,248
        LeakyReLU-50         [-1, 32, 128, 128]               0
           Conv2d-51         [-1, 32, 128, 128]           9,248
        LeakyReLU-52         [-1, 32, 128, 128]               0
		  add  	     [-1, 32, 128, 128]		      0
           Conv2d-53          [-1, 3, 128, 128]             867
        LeakyReLU-54          [-1, 3, 128, 128]               0
================================================================
Total params: 1,086,627
Trainable params: 1,086,627
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.19
Forward/backward pass size (MB): 54.13
Params size (MB): 4.15
Estimated Total Size (MB): 58.47
----------------------------------------------------------------

 MSE Loss: 0.0405933 -- Perceptual Loss: 0.1883005 -- Curr Loss: 0.0701348